12/data/attachments/8b751249561702a8.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_7984fc7a-05c9-4a1e-a54f-bfeba629a358</nif:username>
            <nif:friendToBeAdded>Heidi_around_Friend_95601_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>